print ("Введи радиус круга :")
a=int(input( ))
PI=3.14
b=2*PI*a #длина окружности посчитал 
c=PI*(a**2) #площадь окружности
print ("Длина круга",b,"cm",b/100, "m"), print ("Площадь окружности",c,"cm^2",c/10000,"m^2")
g=a*(2**0.5) #сторона квадрата через описанную окр
h=a*(3**0.5) #сторона равн трег через опис окр
print ("Cторона квадрата",g,"cm",g/100, "m" ), print ("Сторона треугольника",h,"cm",h/100,"m" )
y=2*a #сторона квадрата через впис окр
j=(2*a)*3**0.5 #сторона равн трег через впис окр
k=2*a*((2**0.5)-1) #сторона восьмиугл через впис окр
print ("Cторона квадрата",y,"cm",y/100, "m"), print ("Сторона треугольника",j,"cm",j/100,"m" ), print ("Сторона восьмиугольника",k,"cm",k/100,"m" )