print ("Введи радиус круга :")
a=int(input( ))
PI=3.14
b=2*PI*a #длина окружности посчитал 
c=PI*(a**2) #площадь окружности
print ("Длина круга",b,"cm","или",b/100, "m"), print ("Площадь окружности",c,"cm**2","или",c/10000,"m**2")
g=a*(2**0.5) #сторона квадрата через описанную окр
h=a*(3**0.5) #сторона равн трег через опис окр
print ("Cторона вписанного квадрата",g,"cm","или",g/100, "m" ), print ("Сторона вписанного треугольника",h,"cm","или",h/100,"m" )
y=2*a #сторона квадрата через впис окр
j=(2*a)*3**0.5 #сторона равн трег через впис окр
k=2*a*((2**0.5)-1) #сторона восьмиугл через впис окр
print ("Cторона описанного квадрата",y,"cm","или",y/100, "m"), print ("Сторона описанного треугольника",j,"cm","или",j/100,"m" ), print ("Сторона описанного восьмиугольника",k,"cm","или",k/100,"m" )